src/ddd/Infrastructure/webserver/html/org/eltemadeltema.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-04 Tue 16:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Pascual M.G." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="spacemacs.css">
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org41949c9">1. El tema del tema</a>
<ul>
<li><a href="#org02589b7">1.1. El problema</a></li>
<li><a href="#org838b215">1.2. La soluci칩n</a></li>
<li><a href="#orgde72bf8">1.3. Ahora que sabemos como hacerlo , que colores usamos ?</a>
<ul>
<li><a href="#org25bd53d">1.3.1. <span class="todo TODO">TODO</span> IA al rescate</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org41949c9" class="outline-2">
<h2 id="org41949c9"><span class="section-number-2">1.</span> El tema del tema</h2>
<div class="outline-text-2" id="text-1">
<p>
Siempre he visto que era un verdadero quebradero de cabeza , el mantener un tema de colores para una web , en mi caso como no uso ning칰n framework web, sino que estoy usando custom web components he ideado una forma a mi entender bastante sencilla que para el problema que se prentende solucionar, usando unicamente las capacidades del propio navegador . 
</p>
</div>

<div id="outline-container-org02589b7" class="outline-3">
<h3 id="org02589b7"><span class="section-number-3">1.1.</span> El problema</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Al organizar el c칩digo siguiendo la metodolog칤a atomic
</p>

<ul class="org-ul">
<li>Organism</li>
<li>Molecule</li>
<li>Atom</li>
</ul>

<p>
Siendo esta una organizaci칩n jer치rquica, se hace patente , que si cada uno de los componentes es responsable de su estilo, este tiene que ser coherente y comun a todos ellos.
p
</p>
</div>
</div>
<div id="outline-container-org838b215" class="outline-3">
<h3 id="org838b215"><span class="section-number-3">1.2.</span> La soluci칩n</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Para conseguir esto , he pensado en  hacerlo tambi칠n con un componente , un organismo concretamente. Estableciendo de forma global en <b><b>:root</b></b>  js las variables de color , siendo cada componente el que , si quiere haga uso de ella , permaneciendo el valor HEX del mismo agn칩stico dentro del mismo componente.
</p>

<p>
Si, quiz치 est칠s pensando , en que entonces todos los componentes , tienen que conocer el nombre de las variables del tema, eso es correcto pero solo si estos quieren usarlo. La ventaja es que aqui el framework es el propio navegador , el que se encargar치 de cambiar los colores autom치ticamente con solo cambiar el valor de la propiedad del componente del tema. Magia s칤! pero blanca.
</p>
</div>
</div>

<div id="outline-container-orgde72bf8" class="outline-3">
<h3 id="orgde72bf8"><span class="section-number-3">1.3.</span> Ahora que sabemos como hacerlo , que colores usamos ?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
creo que los mas chulos , los del tema de  <a href="https://github.com/nashamri/spacemacs-theme">spacemacs</a> 游땙 , concretamente el tema dark que es una delicia (dejadle una 游! se lo merece)  y por supuesto los que no pueden faltar , los solarized <a href="https://ethanschoonover.com/solarized/">solarized</a>.
</p>
</div>

<div id="outline-container-org25bd53d" class="outline-4">
<h4 id="org25bd53d"><span class="section-number-4">1.3.1.</span> <span class="todo TODO">TODO</span> IA al rescate</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Extraer el esquema de colores de una funci칩n en lisp es algo muy tedioso para un humano , aqui es donde un LLM nos puede sacar del apuro no sin antes pelearse un poco con el claro.
</p>

<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #51afef;">"dark"</span>: {
    <span style="color: #51afef;">"act1"</span>: <span style="color: #98be65;">"#222226"</span>,
    <span style="color: #51afef;">"act2"</span>: <span style="color: #98be65;">"#5d4d7a"</span>,
    <span style="color: #51afef;">"base"</span>: <span style="color: #98be65;">"#b2b2b2"</span>,
    <span style="color: #51afef;">"base-dim"</span>: <span style="color: #98be65;">"#686868"</span>,
    <span style="color: #51afef;">"bg1"</span>: <span style="color: #98be65;">"#292b2e"</span>,
    <span style="color: #51afef;">"bg2"</span>: <span style="color: #98be65;">"#212026"</span>,
    <span style="color: #51afef;">"bg3"</span>: <span style="color: #98be65;">"#100a14"</span>,
    <span style="color: #51afef;">"bg4"</span>: <span style="color: #98be65;">"#0a0814"</span>,
    <span style="color: #51afef;">"bg-alt"</span>: <span style="color: #98be65;">"#42444a"</span>,
    <span style="color: #51afef;">"border"</span>: <span style="color: #98be65;">"#5d4d7a"</span>,
    <span style="color: #51afef;">"cblk"</span>: <span style="color: #98be65;">"#cbc1d5"</span>,
    <span style="color: #51afef;">"cblk-bg"</span>: <span style="color: #98be65;">"#2f2b33"</span>,
    <span style="color: #51afef;">"cblk-ln"</span>: <span style="color: #98be65;">"#827591"</span>,
    <span style="color: #51afef;">"cblk-ln-bg"</span>: <span style="color: #98be65;">"#373040"</span>,
    <span style="color: #51afef;">"cursor"</span>: <span style="color: #98be65;">"#e3dedd"</span>,
    <span style="color: #51afef;">"const"</span>: <span style="color: #98be65;">"#a45bad"</span>,
    <span style="color: #51afef;">"comment"</span>: <span style="color: #98be65;">"#2aa1ae"</span>,
    <span style="color: #51afef;">"comment-light"</span>: <span style="color: #98be65;">"#2aa1ae"</span>,
    <span style="color: #51afef;">"comment-bg"</span>: <span style="color: #98be65;">"#292e34"</span>,
    <span style="color: #51afef;">"comp"</span>: <span style="color: #98be65;">"#c56ec3"</span>,
    <span style="color: #51afef;">"err"</span>: <span style="color: #98be65;">"#e0211d"</span>,
    <span style="color: #51afef;">"func"</span>: <span style="color: #98be65;">"#bc6ec5"</span>,
    <span style="color: #51afef;">"head1"</span>: <span style="color: #98be65;">"#4f97d7"</span>,
    <span style="color: #51afef;">"head1-bg"</span>: <span style="color: #98be65;">"#293239"</span>,
    <span style="color: #51afef;">"head2"</span>: <span style="color: #98be65;">"#2d9574"</span>,
    <span style="color: #51afef;">"head2-bg"</span>: <span style="color: #98be65;">"#293235"</span>,
    <span style="color: #51afef;">"head3"</span>: <span style="color: #98be65;">"#67b11d"</span>,
    <span style="color: #51afef;">"head3-bg"</span>: <span style="color: #98be65;">"#293235"</span>,
    <span style="color: #51afef;">"head4"</span>: <span style="color: #98be65;">"#b1951d"</span>,
    <span style="color: #51afef;">"head4-bg"</span>: <span style="color: #98be65;">"#32322c"</span>,
    <span style="color: #51afef;">"highlight"</span>: <span style="color: #98be65;">"#444155"</span>,
    <span style="color: #51afef;">"highlight-dim"</span>: <span style="color: #98be65;">"#3b314d"</span>,
    <span style="color: #51afef;">"keyword"</span>: <span style="color: #98be65;">"#4f97d7"</span>,
    <span style="color: #51afef;">"lnum"</span>: <span style="color: #98be65;">"#44505c"</span>,
    <span style="color: #51afef;">"mat"</span>: <span style="color: #98be65;">"#86dc2f"</span>,
    <span style="color: #51afef;">"meta"</span>: <span style="color: #98be65;">"#9f8766"</span>,
    <span style="color: #51afef;">"str"</span>: <span style="color: #98be65;">"#2d9574"</span>,
    <span style="color: #51afef;">"suc"</span>: <span style="color: #98be65;">"#86dc2f"</span>,
    <span style="color: #51afef;">"ttip"</span>: <span style="color: #98be65;">"#9a9aba"</span>,
    <span style="color: #51afef;">"ttip-sl"</span>: <span style="color: #98be65;">"#5e5079"</span>,
    <span style="color: #51afef;">"ttip-bg"</span>: <span style="color: #98be65;">"#34323e"</span>,
    <span style="color: #51afef;">"type"</span>: <span style="color: #98be65;">"#ce537a"</span>,
    <span style="color: #51afef;">"var"</span>: <span style="color: #98be65;">"#7590db"</span>,
    <span style="color: #51afef;">"war"</span>: <span style="color: #98be65;">"#dc752f"</span>,
    <span style="color: #51afef;">"aqua"</span>: <span style="color: #98be65;">"#2d9574"</span>,
    <span style="color: #51afef;">"aqua-bg"</span>: <span style="color: #98be65;">"#293235"</span>,
    <span style="color: #51afef;">"green"</span>: <span style="color: #98be65;">"#67b11d"</span>,
    <span style="color: #51afef;">"green-bg"</span>: <span style="color: #98be65;">"#293235"</span>,
    <span style="color: #51afef;">"green-bg-s"</span>: <span style="color: #98be65;">"#29422d"</span>,
    <span style="color: #51afef;">"cyan"</span>: <span style="color: #98be65;">"#28def0"</span>,
    <span style="color: #51afef;">"red"</span>: <span style="color: #98be65;">"#f2241f"</span>,
    <span style="color: #51afef;">"red-bg"</span>: <span style="color: #98be65;">"#3c2a2c"</span>,
    <span style="color: #51afef;">"red-bg-s"</span>: <span style="color: #98be65;">"#512e31"</span>,
    <span style="color: #51afef;">"blue"</span>: <span style="color: #98be65;">"#4f97d7"</span>,
    <span style="color: #51afef;">"blue-bg"</span>: <span style="color: #98be65;">"#293239"</span>,
    <span style="color: #51afef;">"blue-bg-s"</span>: <span style="color: #98be65;">"#2d4252"</span>,
    <span style="color: #51afef;">"magenta"</span>: <span style="color: #98be65;">"#a31db1"</span>,
    <span style="color: #51afef;">"yellow"</span>: <span style="color: #98be65;">"#b1951d"</span>,
    <span style="color: #51afef;">"yellow-bg"</span>: <span style="color: #98be65;">"#32322c"</span>
  }
}
</pre>
</div>

<p>
y ya solamente queda montarlo en el html
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #51afef;">!DOCTYPE</span> html&gt;
&lt;<span style="color: #c678dd;">html</span> <span style="color: #dcaeea;">lang</span>=<span style="color: #98be65;">"en"</span>&gt;
&lt;<span style="color: #c678dd;">head</span>&gt;
    &lt;<span style="color: #c678dd;">meta</span> <span style="color: #dcaeea;">charset</span>=<span style="color: #98be65;">"UTF-8"</span>&gt;
    &lt;<span style="color: #c678dd;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Pascualmg Portfolio</span>&lt;/<span style="color: #c678dd;">title</span>&gt;
    &lt;<span style="color: #c678dd;">script</span> <span style="color: #dcaeea;">type</span>=<span style="color: #98be65;">"module"</span> <span style="color: #dcaeea;">src</span>=<span style="color: #98be65;">"js/atomic/organism/pascualmg-portfolio.js"</span>&gt;&lt;/<span style="color: #c678dd;">script</span>&gt;
    &lt;<span style="color: #c678dd;">script</span> <span style="color: #dcaeea;">type</span>=<span style="color: #98be65;">"module"</span> <span style="color: #dcaeea;">src</span>=<span style="color: #98be65;">"js/atomic/organism/themeSwitcher.js"</span>&gt;&lt;/<span style="color: #c678dd;">script</span>&gt;
&lt;/<span style="color: #c678dd;">head</span>&gt;
&lt;<span style="color: #c678dd;">body</span>&gt;
&lt;<span style="color: #c678dd;">theme-switcher</span> <span style="color: #dcaeea;">theme</span>=<span style="color: #98be65;">"spacemacs-dark"</span>&gt;&lt;/<span style="color: #c678dd;">theme-switcher</span>&gt;
&lt;<span style="color: #c678dd;">pascualmg-portfolio</span> <span style="color: #dcaeea;">theme</span>=<span style="color: #98be65;">"light"</span>&gt;&lt;/<span style="color: #c678dd;">pascualmg-portfolio</span>&gt;
&lt;/<span style="color: #c678dd;">body</span>&gt;
&lt;/<span style="color: #c678dd;">html</span>&gt;
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org9936bdf"></a><span class="todo TODO">TODO</span> quitar el attr theme al componente del portfolio<br /></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pascual M.G.</p>
<p class="date">Created: 2024-06-04 Tue 16:12</p>
</div>
</body>
</html>
